## staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| delete   | `aws_route53_zone.internal_dns`                              |
| update   | `aws_acm_certificate.internal_dns`                           |
| recreate | `aws_route53_zone.internal_dns`                              |
|          | `aws_secretsmanager_secret_version.internal_dns_cert_base64` |
|          | `aws_secretsmanager_secret_version.internal_dns_fqdn`        |
|          | `tls_self_signed_cert.internal_dns`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
18:08:00.797 STDOUT terraform:   ~ update in-place
18:08:00.797 STDOUT terraform:   - destroy
18:08:00.798 STDOUT terraform: -/+ destroy and then create replacement
18:08:00.798 STDOUT terraform: +/- create replacement and then destroy
18:08:00.798 STDOUT terraform: Terraform will perform the following actions:
18:08:00.798 STDOUT terraform:   # aws_acm_certificate.internal_dns will be updated in-place
18:08:00.798 STDOUT terraform:   ~ resource "aws_acm_certificate" "internal_dns" {
18:08:00.798 STDOUT terraform:       ~ certificate_body          = <<-EOT
18:08:00.798 STDOUT terraform:             -----BEGIN CERTIFICATE-----
18:08:00.798 STDOUT terraform:             MIIC9jCCAd6gAwIBAgIRAJ2rSZ8zF8ZhjHywELGeW8YwDQYJKoZIhvcNAQELBQAw
18:08:00.798 STDOUT terraform:             GzEZMBcGA1UEAxMQbm90aWZpY2F0aW9uLnBydjAeFw0yNTEwMDExODA3MDJaFw0z
18:08:00.798 STDOUT terraform:             MDA5MzAxODA3MDJaMBsxGTAXBgNVBAMTEG5vdGlmaWNhdGlvbi5wcnYwggEiMA0G
18:08:00.798 STDOUT terraform:             CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC79R4jux8cfPiCw6+RGvkpJ43XPqze
18:08:00.798 STDOUT terraform:             OWRwrJZRig0W59+tJiECbJqBkrPds/l60naN19GaKGJB8vDEdya1OU6yNo2k4tAu
18:08:00.798 STDOUT terraform:             xnhYacHzrY/z8UrIvaYIyRDkbwd2baQ/arpa4l8rv6b1WxnHFmn+8pylYdiQp5FE
18:08:00.799 STDOUT terraform:             WuDv9I1DGY7pQZpazUTq7O22EutVK8VdO8p6zkPChyCDy8Fzgy9NntLrnW2dbG7O
18:08:00.799 STDOUT terraform:             vyuqCEIeMK7OQ6sbzdGNMi9Sxixqjtndy+VjOt9t9lFrcj/bxdLfXpb4nZ8bpV+y
18:08:00.799 STDOUT terraform:             9dlBWxR2T3K0Qz2xaE+xi6Ccm6ekyv1pmW0ju580qJmc/TfISfSk7S4lAgMBAAGj
18:08:00.799 STDOUT terraform:             NTAzMA4GA1UdDwEB/wQEAwIFoDATBgNVHSUEDDAKBggrBgEFBQcDATAMBgNVHRMB
18:08:00.799 STDOUT terraform:             Af8EAjAAMA0GCSqGSIb3DQEBCwUAA4IBAQAojaBDSU5xahSDEjwPbSSYjiGdTb/L
18:08:00.799 STDOUT terraform:             aDNrRZBFFrzqecp/utUbirgH3jrNpxvI7m5IQhhsi8BbXwgg/k8v3bwhTAwXZAGC
18:08:00.799 STDOUT terraform:             mctCk1DkKYO0BGLckg4GDtoVIOfZWqQPXPgTxURqW2I7DyANdjTaoru+otecS9Ie
18:08:00.799 STDOUT terraform:             qcggpcGbMypLtWhm6Xff8llyDch1zzELJSixpxBcUL9IzGfS8xIq4k5xyi6C3Vid
18:08:00.799 STDOUT terraform:             kNG2H80+c/k3zFSiAui7Pg35XyPk36MHDAifCk7UHH72g4sz8bw7r4ZGq7PuwRN/
18:08:00.799 STDOUT terraform:             XrbhbYOwOtC5AEdYAZkonDK+95ywD1wvRNTC8kcPxAz4Vdhg53ugnlCD
18:08:00.799 STDOUT terraform:             -----END CERTIFICATE-----
18:08:00.799 STDOUT terraform:         EOT -> (known after apply)
18:08:00.799 STDOUT terraform:         id                        = "arn:aws:acm:ca-central-1:239043911459:certificate/ee889f75-237c-4d72-9833-61a0296b2db8"
18:08:00.799 STDOUT terraform:         tags                      = {
18:08:00.799 STDOUT terraform:             "CostCenter" = "notification-canada-ca-staging"
18:08:00.799 STDOUT terraform:             "Name"       = "notification-canada-ca"
18:08:00.799 STDOUT terraform:         }
18:08:00.799 STDOUT terraform:         # (19 unchanged attributes hidden)
18:08:00.799 STDOUT terraform:         # (1 unchanged block hidden)
18:08:00.800 STDOUT terraform:     }
18:08:00.800 STDOUT terraform:   # aws_route53_zone.internal_dns must be replaced
18:08:00.800 STDOUT terraform: +/- resource "aws_route53_zone" "internal_dns" {
18:08:00.800 STDOUT terraform:       ~ arn                 = "arn:aws:route53:::hostedzone/Z001318429GBPKRLM8P4X" -> (known after apply)
18:08:00.800 STDOUT terraform:       ~ id                  = "Z001318429GBPKRLM8P4X" -> (known after apply)
18:08:00.800 STDOUT terraform:       ~ name                = "notification.prv" -> "staging.notification.internal.com" # forces replacement
18:08:00.800 STDOUT terraform:       ~ name_servers        = [
18:08:00.800 STDOUT terraform:           - "ns-0.awsdns-00.com.",
18:08:00.800 STDOUT terraform:           - "ns-1024.awsdns-00.org.",
18:08:00.800 STDOUT terraform:           - "ns-1536.awsdns-00.co.uk.",
18:08:00.800 STDOUT terraform:           - "ns-512.awsdns-00.net.",
18:08:00.800 STDOUT terraform:         ] -> (known after apply)
18:08:00.800 STDOUT terraform:       ~ primary_name_server = "ns-0.awsdns-00.com." -> (known after apply)
18:08:00.800 STDOUT terraform:       - tags                = {} -> null
18:08:00.800 STDOUT terraform:       ~ tags_all            = {} -> (known after apply)
18:08:00.800 STDOUT terraform:       ~ zone_id             = "Z001318429GBPKRLM8P4X" -> (known after apply)
18:08:00.800 STDOUT terraform:         # (3 unchanged attributes hidden)
18:08:00.800 STDOUT terraform:       - vpc {
18:08:00.800 STDOUT terraform:           - vpc_id     = "vpc-097508d1f5e243195" -> null
18:08:00.800 STDOUT terraform:           - vpc_region = "ca-central-1" -> null
18:08:00.800 STDOUT terraform:         }
18:08:00.800 STDOUT terraform:       + vpc {
18:08:00.800 STDOUT terraform:           + vpc_id     = "vpc-097508d1f5e243195"
18:08:00.800 STDOUT terraform:           + vpc_region = (known after apply)
18:08:00.800 STDOUT terraform:         }
18:08:00.800 STDOUT terraform:     }
18:08:00.800 STDOUT terraform:   # aws_route53_zone.internal_dns (deposed object 574d975d) will be destroyed
18:08:00.801 STDOUT terraform:   # (left over from a partially-failed replacement of this instance)
18:08:00.801 STDOUT terraform:   - resource "aws_route53_zone" "internal_dns" {
18:08:00.801 STDOUT terraform:       - arn                 = "arn:aws:route53:::hostedzone/Z05954862D4D5HXU20M59" -> null
18:08:00.801 STDOUT terraform:       - comment             = "Managed by Terraform" -> null
18:08:00.801 STDOUT terraform:       - force_destroy       = false -> null
18:08:00.801 STDOUT terraform:       - id                  = "Z05954862D4D5HXU20M59" -> null
18:08:00.801 STDOUT terraform:       - name                = "staging.notification.internal.com" -> null
18:08:00.801 STDOUT terraform:       - name_servers        = [
18:08:00.801 STDOUT terraform:           - "ns-0.awsdns-00.com.",
18:08:00.801 STDOUT terraform:           - "ns-1024.awsdns-00.org.",
18:08:00.801 STDOUT terraform:           - "ns-1536.awsdns-00.co.uk.",
18:08:00.801 STDOUT terraform:           - "ns-512.awsdns-00.net.",
18:08:00.801 STDOUT terraform:         ] -> null
18:08:00.801 STDOUT terraform:       - primary_name_server = "ns-0.awsdns-00.com." -> null
18:08:00.801 STDOUT terraform:       - tags                = {} -> null
18:08:00.801 STDOUT terraform:       - tags_all            = {} -> null
18:08:00.801 STDOUT terraform:       - zone_id             = "Z05954862D4D5HXU20M59" -> null
18:08:00.801 STDOUT terraform:         # (1 unchanged attribute hidden)
18:08:00.801 STDOUT terraform:       - vpc {
18:08:00.801 STDOUT terraform:           - vpc_id     = "vpc-097508d1f5e243195" -> null
18:08:00.801 STDOUT terraform:           - vpc_region = "ca-central-1" -> null
18:08:00.801 STDOUT terraform:         }
18:08:00.801 STDOUT terraform:     }
18:08:00.801 STDOUT terraform:   # aws_secretsmanager_secret_version.internal_dns_cert_base64 must be replaced
18:08:00.801 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "internal_dns_cert_base64" {
18:08:00.801 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_CERT_BASE64-NZPM7t" -> (known after apply)
18:08:00.802 STDOUT terraform:       + has_secret_string_wo = (known after apply)
18:08:00.802 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_CERT_BASE64-NZPM7t|terraform-20251001180702958700000003" -> (known after apply)
18:08:00.802 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
18:08:00.802 STDOUT terraform:       ~ version_id           = "terraform-20251001180702958700000003" -> (known after apply)
18:08:00.802 STDOUT terraform:       ~ version_stages       = [
18:08:00.802 STDOUT terraform:           - "AWSCURRENT",
18:08:00.802 STDOUT terraform:         ] -> (known after apply)
18:08:00.802 STDOUT terraform:         # (4 unchanged attributes hidden)
18:08:00.802 STDOUT terraform:     }
18:08:00.802 STDOUT terraform:   # aws_secretsmanager_secret_version.internal_dns_fqdn must be replaced
18:08:00.802 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "internal_dns_fqdn" {
18:08:00.802 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_FQDN-pUqTjc" -> (known after apply)
18:08:00.802 STDOUT terraform:       + has_secret_string_wo = (known after apply)
18:08:00.802 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_FQDN-pUqTjc|terraform-20251001180702941000000002" -> (known after apply)
18:08:00.802 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
18:08:00.802 STDOUT terraform:       ~ version_id           = "terraform-20251001180702941000000002" -> (known after apply)
18:08:00.802 STDOUT terraform:       ~ version_stages       = [
18:08:00.802 STDOUT terraform:           - "AWSCURRENT",
18:08:00.802 STDOUT terraform:         ] -> (known after apply)
18:08:00.802 STDOUT terraform:         # (4 unchanged attributes hidden)
18:08:00.802 STDOUT terraform:     }
18:08:00.802 STDOUT terraform:   # tls_self_signed_cert.internal_dns must be replaced
18:08:00.802 STDOUT terraform: +/- resource "tls_self_signed_cert" "internal_dns" {
18:08:00.803 STDOUT terraform:       ~ cert_pem              = <<-EOT
18:08:00.803 STDOUT terraform:             -----BEGIN CERTIFICATE-----
18:08:00.803 STDOUT terraform:             MIIC9jCCAd6gAwIBAgIRAJ2rSZ8zF8ZhjHywELGeW8YwDQYJKoZIhvcNAQELBQAw
18:08:00.803 STDOUT terraform:             GzEZMBcGA1UEAxMQbm90aWZpY2F0aW9uLnBydjAeFw0yNTEwMDExODA3MDJaFw0z
18:08:00.803 STDOUT terraform:             MDA5MzAxODA3MDJaMBsxGTAXBgNVBAMTEG5vdGlmaWNhdGlvbi5wcnYwggEiMA0G
18:08:00.803 STDOUT terraform:             CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC79R4jux8cfPiCw6+RGvkpJ43XPqze
18:08:00.803 STDOUT terraform:             OWRwrJZRig0W59+tJiECbJqBkrPds/l60naN19GaKGJB8vDEdya1OU6yNo2k4tAu
18:08:00.803 STDOUT terraform:             xnhYacHzrY/z8UrIvaYIyRDkbwd2baQ/arpa4l8rv6b1WxnHFmn+8pylYdiQp5FE
18:08:00.803 STDOUT terraform:             WuDv9I1DGY7pQZpazUTq7O22EutVK8VdO8p6zkPChyCDy8Fzgy9NntLrnW2dbG7O
18:08:00.803 STDOUT terraform:             vyuqCEIeMK7OQ6sbzdGNMi9Sxixqjtndy+VjOt9t9lFrcj/bxdLfXpb4nZ8bpV+y
18:08:00.803 STDOUT terraform:             9dlBWxR2T3K0Qz2xaE+xi6Ccm6ekyv1pmW0ju580qJmc/TfISfSk7S4lAgMBAAGj
18:08:00.803 STDOUT terraform:             NTAzMA4GA1UdDwEB/wQEAwIFoDATBgNVHSUEDDAKBggrBgEFBQcDATAMBgNVHRMB
18:08:00.803 STDOUT terraform:             Af8EAjAAMA0GCSqGSIb3DQEBCwUAA4IBAQAojaBDSU5xahSDEjwPbSSYjiGdTb/L
18:08:00.803 STDOUT terraform:             aDNrRZBFFrzqecp/utUbirgH3jrNpxvI7m5IQhhsi8BbXwgg/k8v3bwhTAwXZAGC
18:08:00.803 STDOUT terraform:             mctCk1DkKYO0BGLckg4GDtoVIOfZWqQPXPgTxURqW2I7DyANdjTaoru+otecS9Ie
18:08:00.803 STDOUT terraform:             qcggpcGbMypLtWhm6Xff8llyDch1zzELJSixpxBcUL9IzGfS8xIq4k5xyi6C3Vid
18:08:00.803 STDOUT terraform:             kNG2H80+c/k3zFSiAui7Pg35XyPk36MHDAifCk7UHH72g4sz8bw7r4ZGq7PuwRN/
18:08:00.803 STDOUT terraform:             XrbhbYOwOtC5AEdYAZkonDK+95ywD1wvRNTC8kcPxAz4Vdhg53ugnlCD
18:08:00.803 STDOUT terraform:             -----END CERTIFICATE-----
18:08:00.803 STDOUT terraform:         EOT -> (known after apply)
18:08:00.803 STDOUT terraform:       ~ id                    = "209578171330032631533107726822871555014" -> (known after apply)
18:08:00.804 STDOUT terraform:       ~ key_algorithm         = "RSA" -> (known after apply)
18:08:00.804 STDOUT terraform:       ~ validity_end_time     = "2030-09-30T18:07:02.95115204Z" -> (known after apply)
18:08:00.804 STDOUT terraform:       ~ validity_start_time   = "2025-10-01T18:07:02.95115204Z" -> (known after apply)
18:08:00.804 STDOUT terraform:         # (8 unchanged attributes hidden)
18:08:00.804 STDOUT terraform:       ~ subject { # forces replacement
18:08:00.804 STDOUT terraform:           ~ common_name = "notification.prv" -> "staging.notification.internal.com" # forces replacement
18:08:00.804 STDOUT terraform:         }
18:08:00.804 STDOUT terraform:     }
18:08:00.804 STDOUT terraform: Plan: 4 to add, 1 to change, 5 to destroy.
18:08:00.804 STDOUT terraform: Changes to Outputs:
18:08:00.804 STDOUT terraform:   ~ internal_dns_name                     = "notification.prv" -> "staging.notification.internal.com"
18:08:00.804 STDOUT terraform:   ~ internal_dns_zone_id                  = "Z001318429GBPKRLM8P4X" -> (known after apply)
18:08:00.804 STDOUT terraform:   ~ notification_internal_dns_cert        = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM5akNDQWQ2Z0F3SUJBZ0lSQUoyclNaOHpGOFpoakh5d0VMR2VXOFl3RFFZSktvWklodmNOQVFFTEJRQXcKR3pFWk1CY0dBMVVFQXhNUWJtOTBhV1pwWTJGMGFXOXVMbkJ5ZGpBZUZ3MHlOVEV3TURFeE9EQTNNREphRncwegpNREE1TXpBeE9EQTNNREphTUJzeEdUQVhCZ05WQkFNVEVHNXZkR2xtYVdOaGRHbHZiaTV3Y25Zd2dnRWlNQTBHCkNTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFDNzlSNGp1eDhjZlBpQ3c2K1JHdmtwSjQzWFBxemUKT1dSd3JKWlJpZzBXNTkrdEppRUNiSnFCa3JQZHMvbDYwbmFOMTlHYUtHSkI4dkRFZHlhMU9VNnlObzJrNHRBdQp4bmhZYWNIenJZL3o4VXJJdmFZSXlSRGtid2QyYmFRL2FycGE0bDhydjZiMVd4bkhGbW4rOHB5bFlkaVFwNUZFCld1RHY5STFER1k3cFFacGF6VVRxN08yMkV1dFZLOFZkTzhwNnprUENoeUNEeThGemd5OU5udExyblcyZGJHN08Kdnl1cUNFSWVNSzdPUTZzYnpkR05NaTlTeGl4cWp0bmR5K1ZqT3Q5dDlsRnJjai9ieGRMZlhwYjRuWjhicFYreQo5ZGxCV3hSMlQzSzBRejJ4YUUreGk2Q2NtNmVreXYxcG1XMGp1NTgwcUptYy9UZklTZlNrN1M0bEFnTUJBQUdqCk5UQXpNQTRHQTFVZER3RUIvd1FFQXdJRm9EQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0RBVEFNQmdOVkhSTUIKQWY4RUFqQUFNQTBHQ1NxR1NJYjNEUUVCQ3dVQUE0SUJBUUFvamFCRFNVNXhhaFNERWp3UGJTU1lqaUdkVGIvTAphRE5yUlpCRkZyenFlY3AvdXRVYmlyZ0gzanJOcHh2STdtNUlRaGhzaThCYlh3Z2cvazh2M2J3aFRBd1haQUdDCm1jdENrMURrS1lPMEJHTGNrZzRHRHRvVklPZlpXcVFQWFBnVHhVUnFXMkk3RHlBTmRqVGFvcnUrb3RlY1M5SWUKcWNnZ3BjR2JNeXBMdFdobTZYZmY4bGx5RGNoMXp6RUxKU2l4cHhCY1VMOUl6R2ZTOHhJcTRrNXh5aTZDM1ZpZAprTkcySDgwK2MvazN6RlNpQXVpN1BnMzVYeVBrMzZNSERBaWZDazdVSEg3Mmc0c3o4Ync3cjRaR3E3UHV3Uk4vClhyYmhiWU93T3RDNUFFZFlBWmtvbkRLKzk1eXdEMXd2Uk5UQzhrY1B4QXo0VmRoZzUzdWdubENECi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
18:08:00.805 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:08:00.805 STDOUT terraform: Saved the plan to: plan.tfplan
18:08:00.805 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:08:00.805 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"custom-sending-domain.staging.notification.cdssandbox.xyz\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
